# Data Science for Absolute Beginners
## DataFrame Properties

In [1]:
# load pandas
import pandas as pd

In [9]:
# load four different dataframes
#t0 = pd.read_csv("data/t0.csv")
#t1 = pd.read_csv("data/t1.csv")
#t2 = pd.read_csv("data/t2.csv", index_col=0)
t = pd.read_csv("data/t.csv", index_col=0)

In [10]:
t

            Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
France      109   88   71   26   83   18   72   37   40   90   17   86
Vietnam      25   63   90   37   54   87   85   75   57   40   94   96
Japan        28   19   51   72   11   92   26   88   15   68   10   90
Australia    14   46   61   37   41   12   78   48   93   29   28   17
Canada       40   72   21   77   75   65   13  101   88   37   39   43
Chile        99   95   17   26  104   24  100   41   19   48   57   26
Uruguay      15   44   55   69   34   23   41   42   86   54   15   24
Mozambique   57  104   92   10   17   96   26   74   18  100   54   47
India       104   85   15   32   62   79   92   70  101   39   98  107
Greece      102   89   80   45   30   59   82   42   92   23  102   28

In [11]:
t.iloc[2:5,1:4]

           Feb  Mar  Apr
Japan       19   51   72
Australia   46   61   37
Canada      72   21   77

In [13]:
t.loc['Japan':'Uruguay','Feb':'May']

           Feb  Mar  Apr  May
Japan       19   51   72   11
Australia   46   61   37   41
Canada      72   21   77   75
Chile       95   17   26  104
Uruguay     44   55   69   34